; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v10 ?v7)
             (pred_4 ?v5 ?v8)
             (pred_7 ?v10 ?v8)
             (pred_1 ?v4 ?v10 )
	     (pred_12 ?v10)
             (pred_2 ?v3)
             (pred_5 ?v5)
             (pred_8 ?v8)
             (pred_10 ?v10)
             (pred_9 ?v5)
             (pred_6 ?v10)
             (pred_11 ))



(:action op_3
:parameters (?v6 ?v12 ?v11 ?v1)
:precondition (and (pred_2 ?v6) (pred_2 ?v12) (pred_5 ?v11) (pred_8 ?v1)
          (pred_3 ?v6 ?v12) (pred_4 ?v11 ?v1)
                   (pred_7 ?v12 ?v1) (pred_12 ?v6) 
                   (pred_10 ?v12) (pred_9 ?v11))
:effect (and  (pred_6 ?v12) (not (pred_10 ?v12))))


(:action op_5
:parameters (?v6 ?v9)
:precondition (and (pred_2 ?v6) (pred_2 ?v9)
               (pred_12 ?v6) (pred_3 ?v6 ?v9) (pred_6 ?v9))
:effect (and (pred_12 ?v9) (not (pred_12 ?v6))))

(:action op_2
:parameters (?v6 ?v11)
:precondition (and (pred_2 ?v6) (pred_5 ?v11) 
                  (pred_12 ?v6) (pred_1 ?v11 ?v6) (pred_11 ))
:effect (and (pred_9 ?v11)
   (not (pred_1 ?v11 ?v6)) (not (pred_11 ))))


(:action op_4
:parameters (?v6 ?v13 ?v2)
:precondition (and (pred_2 ?v6) (pred_5 ?v13) (pred_5 ?v2)
                  (pred_12 ?v6) (pred_9 ?v2) (pred_1 ?v13 ?v6))
:effect (and (pred_9 ?v13) (pred_1 ?v2 ?v6)
        (not (pred_9 ?v2)) (not (pred_1 ?v13 ?v6))))

(:action op_1
:parameters (?v6 ?v11)
:precondition (and (pred_2 ?v6) (pred_5 ?v11) 
                  (pred_12 ?v6) (pred_9 ?v11))
:effect (and (pred_11 ) (pred_1 ?v11 ?v6) (not (pred_9 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_21 obj_09 obj_18 obj_24 obj_16 obj_26 obj_10 obj_15 obj_11 obj_22 obj_08 obj_06 obj_02 obj_03 obj_23 obj_12 obj_19 obj_28 obj_25 obj_30 obj_20 obj_07 obj_05 obj_13
    obj_04 obj_27
    obj_29 obj_14 obj_01
    )

    (:init
       (pred_11)

       (pred_2 obj_17)
       (pred_2 obj_21)
       (pred_2 obj_09)
       (pred_2 obj_18)
       (pred_2 obj_24)
       (pred_2 obj_16)
       (pred_2 obj_26)
       (pred_2 obj_10)
       (pred_2 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_22)
       (pred_2 obj_08)
       (pred_2 obj_06)
       (pred_2 obj_02)
       (pred_2 obj_03)
       (pred_2 obj_23)
       (pred_2 obj_12)
       (pred_2 obj_19)
       (pred_2 obj_28)
       (pred_2 obj_25)
       (pred_2 obj_30)
       (pred_2 obj_20)
       (pred_2 obj_07)
       (pred_2 obj_05)
       (pred_2 obj_13)
       (pred_8 obj_04)
       (pred_8 obj_27)
       (pred_5 obj_29)
       (pred_5 obj_14)
       (pred_5 obj_01)

       (pred_3 obj_17 obj_16)
       (pred_3 obj_17 obj_21)
       (pred_3 obj_21 obj_26)
       (pred_3 obj_21 obj_09)
       (pred_3 obj_21 obj_17)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_09 obj_18)
       (pred_3 obj_09 obj_21)
       (pred_3 obj_18 obj_15)
       (pred_3 obj_18 obj_24)
       (pred_3 obj_18 obj_09)
       (pred_3 obj_24 obj_11)
       (pred_3 obj_24 obj_18)
       (pred_3 obj_16 obj_22)
       (pred_3 obj_16 obj_26)
       (pred_3 obj_16 obj_17)
       (pred_3 obj_26 obj_08)
       (pred_3 obj_26 obj_10)
       (pred_3 obj_26 obj_21)
       (pred_3 obj_26 obj_16)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_10 obj_15)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_10 obj_26)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_15 obj_11)
       (pred_3 obj_15 obj_18)
       (pred_3 obj_15 obj_10)
       (pred_3 obj_11 obj_03)
       (pred_3 obj_11 obj_24)
       (pred_3 obj_11 obj_15)
       (pred_3 obj_22 obj_23)
       (pred_3 obj_22 obj_08)
       (pred_3 obj_22 obj_16)
       (pred_3 obj_08 obj_12)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_08 obj_26)
       (pred_3 obj_08 obj_22)
       (pred_3 obj_06 obj_19)
       (pred_3 obj_06 obj_02)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_02 obj_28)
       (pred_3 obj_02 obj_03)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_02 obj_06)
       (pred_3 obj_03 obj_25)
       (pred_3 obj_03 obj_11)
       (pred_3 obj_03 obj_02)
       (pred_3 obj_23 obj_30)
       (pred_3 obj_23 obj_12)
       (pred_3 obj_23 obj_22)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_12 obj_19)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_12 obj_23)
       (pred_3 obj_19 obj_07)
       (pred_3 obj_19 obj_28)
       (pred_3 obj_19 obj_06)
       (pred_3 obj_19 obj_12)
       (pred_3 obj_28 obj_05)
       (pred_3 obj_28 obj_25)
       (pred_3 obj_28 obj_02)
       (pred_3 obj_28 obj_19)
       (pred_3 obj_25 obj_13)
       (pred_3 obj_25 obj_03)
       (pred_3 obj_25 obj_28)
       (pred_3 obj_30 obj_20)
       (pred_3 obj_30 obj_23)
       (pred_3 obj_20 obj_07)
       (pred_3 obj_20 obj_12)
       (pred_3 obj_20 obj_30)
       (pred_3 obj_07 obj_05)
       (pred_3 obj_07 obj_19)
       (pred_3 obj_07 obj_20)
       (pred_3 obj_05 obj_13)
       (pred_3 obj_05 obj_28)
       (pred_3 obj_05 obj_07)
       (pred_3 obj_13 obj_25)
       (pred_3 obj_13 obj_05)
       (pred_10 obj_16)
       (pred_10 obj_03)
       (pred_10 obj_23)
       (pred_7  obj_16 obj_04)
       (pred_7  obj_03 obj_27)
       (pred_7  obj_23 obj_04)
       (pred_6 obj_17)
       (pred_6 obj_21)
       (pred_6 obj_09)
       (pred_6 obj_18)
       (pred_6 obj_24)
       (pred_6 obj_26)
       (pred_6 obj_10)
       (pred_6 obj_15)
       (pred_6 obj_11)
       (pred_6 obj_22)
       (pred_6 obj_08)
       (pred_6 obj_06)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_19)
       (pred_6 obj_28)
       (pred_6 obj_25)
       (pred_6 obj_30)
       (pred_6 obj_20)
       (pred_6 obj_07)
       (pred_6 obj_05)
       (pred_6 obj_13)

       (pred_4  obj_29 obj_04)
       (pred_4  obj_14 obj_27)
       (pred_4  obj_01 obj_04)
       (pred_1 obj_29 obj_03)
       (pred_1 obj_14 obj_20)
       (pred_1 obj_01 obj_10)
       (pred_12 obj_09)
    )

    (:goal (and
       (pred_1 obj_01 obj_24)
    ))
(:constraints
  (always (not (pred_12 obj_18)))
)
)

; plan
1. (op_5 obj_09 obj_10)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_10)
   goals met: 0 of 1
2. (op_2 obj_10 obj_01)
   deleted: (pred_1 obj_01 obj_10) (pred_11)
   added: (pred_9 obj_01)
   goals met: 0 of 1
3. (op_5 obj_10 obj_15)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_15)
   goals met: 0 of 1
4. (op_5 obj_15 obj_11)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_11)
   goals met: 0 of 1
5. (op_5 obj_11 obj_24)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_24)
   goals met: 0 of 1
6. (op_1 obj_24 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_11) (pred_1 obj_01 obj_24)
   goals met: 1 of 1
